weaver/socialnetwork/evaluation/gcp/2024-08-05_18:12:09/workload.out
#./manager.py wrk2 --gcp -d 300 -t 10 -r 100
Running 5m test @ http://34.141.111.58:12345/wrk2-api/post/compose
  10 threads and 10 connections
  Thread calibration: mean lat.: 18.608ms, rate sampling interval: 49ms
  Thread calibration: mean lat.: 19.056ms, rate sampling interval: 54ms
  Thread calibration: mean lat.: 19.283ms, rate sampling interval: 52ms
  Thread calibration: mean lat.: 18.335ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 19.229ms, rate sampling interval: 52ms
  Thread calibration: mean lat.: 17.981ms, rate sampling interval: 47ms
  Thread calibration: mean lat.: 19.579ms, rate sampling interval: 61ms
  Thread calibration: mean lat.: 18.856ms, rate sampling interval: 54ms
  Thread calibration: mean lat.: 19.565ms, rate sampling interval: 53ms
  Thread calibration: mean lat.: 17.865ms, rate sampling interval: 48ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.33s     2.79s   12.30s    87.24%
    Req/Sec     9.40     10.90    40.00     92.32%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   72.51ms
 75.000%  607.23ms
 90.000%    5.55s 
 99.000%   12.30s 
 99.900%   14.22s 
 99.990%   15.06s 
 99.999%   15.29s 
100.000%   15.29s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      12.615     0.000000            1         1.00
      25.247     0.100000         2769         1.11
      32.143     0.200000         5538         1.25
      40.927     0.300000         8313         1.43
      52.831     0.400000        11073         1.67
      72.511     0.500000        13841         2.00
      88.639     0.550000        15226         2.22
     113.791     0.600000        16612         2.50
     158.975     0.650000        17996         2.86
     261.375     0.700000        19379         3.33
     607.231     0.750000        20762         4.00
     991.231     0.775000        21454         4.44
    1662.975     0.800000        22146         5.00
    2402.303     0.825000        22838         5.71
    3231.743     0.850000        23530         6.67
    4263.935     0.875000        24222         8.00
    5074.943     0.887500        24572         8.89
    5545.983     0.900000        24916        10.00
    6094.847     0.912500        25261        11.43
    6787.071     0.925000        25610        13.33
    7507.967     0.937500        25952        16.00
    7946.239     0.943750        26126        17.78
    8519.679     0.950000        26299        20.00
    8888.319     0.956250        26472        22.86
    9306.111     0.962500        26648        26.67
    9830.399     0.968750        26817        32.00
   10043.391     0.971875        26905        35.56
   10280.959     0.975000        26991        40.00
   10452.991     0.978125        27077        45.71
   10723.327     0.981250        27163        53.33
   11190.271     0.984375        27250        64.00
   11427.839     0.985938        27294        71.11
   11673.599     0.987500        27336        80.00
   12058.623     0.989062        27380        91.43
   12550.143     0.990625        27425       106.67
   12877.823     0.992188        27466       128.00
   13041.663     0.992969        27488       142.22
   13180.927     0.993750        27510       160.00
   13295.615     0.994531        27531       182.86
   13426.687     0.995313        27553       213.33
   13582.335     0.996094        27576       256.00
   13615.103     0.996484        27585       284.44
   13672.447     0.996875        27599       320.00
   13754.367     0.997266        27608       365.71
   13819.903     0.997656        27619       426.67
   13910.015     0.998047        27628       512.00
   13942.783     0.998242        27634       568.89
   14016.511     0.998437        27639       640.00
   14090.239     0.998633        27645       731.43
   14131.199     0.998828        27651       853.33
   14254.079     0.999023        27655      1024.00
   14295.039     0.999121        27658      1137.78
   14360.575     0.999219        27661      1280.00
   14508.031     0.999316        27664      1462.86
   14565.375     0.999414        27666      1706.67
   14794.751     0.999512        27669      2048.00
   14835.711     0.999561        27670      2275.56
   14860.287     0.999609        27672      2560.00
   14868.479     0.999658        27674      2925.71
   14868.479     0.999707        27674      3413.33
   14909.439     0.999756        27677      4096.00
   14909.439     0.999780        27677      4551.11
   14909.439     0.999805        27677      5120.00
   14934.015     0.999829        27678      5851.43
   14934.015     0.999854        27678      6826.67
   15056.895     0.999878        27679      8192.00
   15056.895     0.999890        27679      9102.22
   15147.007     0.999902        27680     10240.00
   15147.007     0.999915        27680     11702.86
   15147.007     0.999927        27680     13653.33
   15220.735     0.999939        27681     16384.00
   15220.735     0.999945        27681     18204.44
   15220.735     0.999951        27681     20480.00
   15220.735     0.999957        27681     23405.71
   15220.735     0.999963        27681     27306.67
   15286.271     0.999969        27682     32768.00
   15286.271     1.000000        27682          inf
#[Mean    =     1330.636, StdDeviation   =     2789.023]
#[Max     =    15278.080, Total count    =        27682]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  28720 requests in 5.00m, 15.96MB read
Requests/sec:     95.73
Transfer/sec:     54.48KB
